[
    {
        "id": "01",
        "name": "Artificial Intelligence",
        "img": "https://i.ibb.co/5GPVKjH/1.jpg",
        "details": "All but the simplest human behaviour is ascribed to intelligence, while even the most complicated insect behaviour is never taken as an indication of intelligence. What is the difference? Consider the behaviour of the digger wasp, Sphex ichneumoneus. When the female wasp returns to her burrow with food, she first deposits it on the threshold, checks for intruders inside her burrow, and only then, if the coast is clear, carries her food inside. The real nature of the wasps instinctual behaviour is revealed if the food is moved a few inches away from the entrance to her burrow while she is inside: on emerging, she will repeat the whole procedure as often as the food is displaced. Intelligence—conspicuously absent in the case of Sphex—must include the ability to adapt to new circumstances. Psychologists generally do not characterize human intelligence by just one trait but by the combination of many diverse abilities. Research in AI has focused chiefly on the following components of intelligence: learning, reasoning, problem solving, perception, and using language.There are a number of different forms of learning as applied to artificial intelligence. The simplest is learning by trial and error. For example, a simple computer program for solving mate-in-one chess problems might try moves at random until mate is found. The program might then store the solution with the position so that the next time the computer encountered the same position it would recall the solution. This simple memorizing of individual items and procedures—known as rote learning—is relatively easy to implement on a computer. More challenging is the problem of implementing what is called generalization. Generalization involves applying past experience to analogous new situations. For example, a program that learns the past tense of regular English verbs by rote will not be able to produce the past tense of a word such as jump unless it previously had been presented with jumped, whereas a program that is able to generalize can learn the “add ed” rule and so form the past tense of jump based on experience with similar verbs."
    },
    {
        "id": "02",
        "name": "Game Design",
        "img": "https://i.ibb.co/QnV6mS9/2.jpg",
        "details": "Video games are a thriving industry both in the US and abroad, and the number of careers pertaining to the creation of video games has increased exponentially. Seizing on this trend, a growing number of international students have decided to take their passion for playing video games and turn it into a career in game design. Designing video games is a dream job for many gamers, and the reasons that are making the decision to study game design so popular are plenty; the video game industry is home to diverse job opportunities, enjoyable and fun work environments and high starting salaries. International students who study game design will be on their way to a career that thrives on creativity and imagination.However, not everyone who enjoys playing video games will enjoy creating them. In fact, creating a video game is a long and complex process with many subsequent tasks and roles required to make a finished, playable product. To successfully study game design, an international student will need to inquire about more than just the fun they will have being immersed in game-related curriculum. In order to know whether a degree in game design is right for them, international students will need to ask, gaSowhat is game design? Game design is a subset of the field of video game development. Game design is a field with a broad focus. As suchthe skills of a game designer are drawn from the fields of computer science and programming, creative writing and graphic design. Game designers take the creative lead in imagining and bringing to life video game stories, characters, gameplay, rules, interfaces, dialogue and environments. This being the case, a game designer is a cross between a writer, artist and programmer. It is an individual who presents a comprehensive artistic vision, while also possessing the technical skill to oversee and contribute to programming, image rendering, level design, digital editing and other construction aspects of game design.A game designer's role on a development team differs from the specialized roles of graphic designers and programmers. Graphic designers and game programmers have specific tasks to accomplish in the division of labor that goes into creating a video game, international students can major in those specific disciplines if desired. However, international students who study game design in the US will be groomed to create their own video game from the ground up as well as take on a role on a development team. That being the case, international students who study game design must decide what role on a development team they would like to have upon graduation. Once a desired role has been established, an international student should then subsequently fine-tune to the degree they are to receive. This will ensure that they are optimally prepared for that particular role on a development team until they have the industry credibility necessary in order to be given the reins over creating their very own title."
    },
    {
        "id": "03",
        "name": "Information Security",
        "img": "https://i.ibb.co/KG89xRx/3.jpg",
        "details": "Information Security is not only about securing information from unauthorized access. Information Security is basically the practice of preventing unauthorized access, use, disclosure, disruption, modification, inspection, recording or destruction of information. Information can be physical or electronic one. Information can be anything like Your details or we can say your profile on social media, your data in mobile phone, your biometrics etc. Thus Information Security spans so many research areas like Cryptography, Mobile Computing, Cyber Forensics, Online Social Media etc. During First World War, Multi-tier Classification System was developed keeping in mind sensitivity of information. With the beginning of Second World War formal alignment of Classification System was done. Alan Turing was the one who successfully decrypted Enigma Machine which was used by Germans to encrypt warfare data. Information Security programs are build around 3 objectives, commonly known as CIA  Confidentiality, Integrity, Availability.Confidentiality  means information is not disclosed to unauthorized individuals, entities and process. For example if we say I have a password for my Gmail account but someone saw while I was doing a login into Gmail account. In that case my password has been compromised and Confidentiality has been breached.Integrity  means maintaining accuracy and completeness of data. This means data cannot be edited in an unauthorized way. For example if an employee leaves an organisation then in that case data for that employee in all departments like accounts, should be updated to reflect status to JOB LEFT so that data is complete and accurate and in addition to this only authorized person should be allowed to edit employee data.Availability  means information must be available when needed. For example if one needs to access information of a particular employee to check whether employee has outstanded the number of leaves, in that case it requires collaboration from different organizational teams like network operations, development operations, incident response and policy/change management. Denial of service attack is one of the factor that can hamper the availability of information."
    },
    {
        "id": "04",
        "name": "Data Science",
        "img": "https://i.ibb.co/HGgCBWv/4.jpg",
        "details": "Data science is the domain of study that deals with vast volumes of data using modern tools and techniques to find unseen patterns, derive meaningful information, and make business decisions. Data science uses complex machine learning algorithms to build predictive models.The data used for analysis can come from many different sources and presented in various formats.Now that you know what data science is, lets see why data science is essential to todays IT landscape.The Data Science LifecycleNow that you know what is data science, next up let us focus on the data science lifecycle. Data sciences lifecycle consists of five distinct stages, each with its own tasks:Capture: Data Acquisition, Data Entry, Signal Reception, Data Extraction. This stage involves gathering raw structured and unstructured data.Maintain: Data Warehousing, Data Cleansing, Data Staging, Data Processing, Data Architecture. This stage covers taking the raw data and putting it in a form that can be useDataMining,Clustering/Classification, Data Modeling, Data Summarization. Data scientists take the prepared data and examine its patterns, ranges, and biases to determine how useful it will be in predictive analysis.Analyze: Exploratory/Confirmatory, Predictive Analysis, Regression, Text Mining, Qualitative Analysis. Here is the real meat of the lifecycle. This stage involves performing the various analyses on the data. Communicate: Data Reporting, Data Visualization, Business Intelligence, Decision Making. In this final step, analysts prepare the analyses in easily readable forms such as charts, graphs, and reports.Prerequisites for Data ScienceHere are some of the technical concepts you should know about before starting to learn what is data science.Machine learning is the backbone of data science. Data Scientists need to have a solid grasp of ML in addition to basic knowledge of statistics.Mathematical models enable you to make quick calculations and predictions based on what you already know about the data. Modeling is also a part of Machine Learning and involves identifying which algorithm is the most suitable to solve a given problem and how to train these models.Statistics are at the core of data science. A sturdy handle on statistics can help you extract more intelligence and obtain more meaningful results."
    },
    {
        "id": "05",
        "name": "Software Engineering",
        "img": "https://i.ibb.co/CQDzCgn/5.jpg",
        "details": "Reduces complexity: Big software is always complicated and challenging to progress. Software engineering has a great solution to reduce the complication of any project. Software engineering divides big problems into various small issues. And then start solving each small issue one by one. All these small problems are solved independently to each other.To minimize software cost: Software needs a lot of hardwork and software engineers are highly paid experts. A lot of manpower is required to develop software with a large number of codes. But in software engineering, programmers project everything and decrease all those things that are not needed. In turn, the cost for software productions becomes less as compared to any software that does not use software engineering method.To decrease time: Anything that is not made according to the project always wastes time. And if you are making great software, then you may need to run many codes to get the definitive running code. This is a very time-consuming procedure, and if it is not well handled, then this can take a lot of time. So if you are making your software according to the software engineering method, then it will decrease a lot of time. Handling big projects: Big projects are not done in a couple of days, and they need lots of patience, planning, and management. And to invest six and seven months of any company, it requires heaps of planning, direction, testing, and maintenance. No one can say that he has given four months of a company to the task, and the project is still in its first stage. Because the company has provided many resources to the plan and it should be completed. So to handle a big project without any problem, the company has to go for a software engineering method. Reliable software: Software should be secure, means if you have delivered the software, then it should work for at least its given time or subscription. And if any bugs come in the software, the company is responsible for solving all these bugs. Because in software engineering, testing and maintenance are given, so there is no worry of its reliability. Effectiveness: Effectiveness comes if anything has made according to the standards. Software standards are the big target of companies to make it more effective. So Software becomes more effective in the act with the help of software engineering."
    },
    {
        "id": "06",
        "name": "Programming Languages",
        "img": "https://i.ibb.co/zStJ4kL/6.jpg",
        "details": "A programming language is a way for programmers (developers) to communicate with computers. Programming languages consist of a set of rules that allows string values to be converted into various ways of generating machine code, or, in the case of visual programming languages, graphical elements.Generally speaking, a program is a set of instructions written in a particular language (C, C++, Java, Python) to achieve a particular task.What Are the Best Programming Languages to Learn in 2023?What coding and programming language should i learn? JavaScript and Python, two of the most popular languages in the startup industry, are in high demand. Most startups use Python-based backend frameworks such as Django (Python), Flask (Python), and NodeJS (JavaScript). These languages are also considered to be the best programming languages to learn for beginners.Below is a list of the most popular programming languages that will be in demand in Javascript Python Go Java Kotli PHP . Javascript JavaScript is a high-level programming language that is one of the core technologies of the World Wide Web. It is used as a client-side programming language by 97.8 percent of all websites. JavaScript was originally used only to develop web browsers, but they are now used for server-side website deployments and non-web browser applications as well. Javascript was created in 1995 and was initially known as LiveScript. However, Java was a very popular language at that time, so it was advertised as a “younger brother” of Java. As it evolved over time, JavaScript became a fully independent language. Nowadays, JavaScript is often confused with Java, and although there are some similarities between them, the two languages are distinct."
    }
]